# DimensionLineLength Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
OrdinateDimensionSetting..::..DimensionLineLength Property
OrdinateDimensionSetting Class See Also
---
Specifies the dimension line segment length. This setting is enabled when Dimension Line Style is Segmented.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2017 Subscription Update
# Syntax
C#
---
```text
public double DimensionLineLength { get; set; }
```

Visual Basic
---
```text
Public Property DimensionLineLength As Double
	Get
	Set
```

Visual C++
---
```text
public:
property double DimensionLineLength {
	double get ();
	void set (double value);
}
```

# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentOutOfRangeException | When setting this property: The given value for dimensionLineLength must be greater than 0 and no more than 30000 feet. |

# See Also
OrdinateDimensionSetting Class
Autodesk.Revit.DB Namespace